#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.docker[0].docker_container.honeypot[0] will be created
  + resource "docker_container" "honeypot" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "COWRIE_JSON_LOG_ENABLED=true",
          + "COWRIE_OUTPUT_ELASTICSEARCH_ENABLED=true",
          + "COWRIE_OUTPUT_ELASTICSEARCH_HOST=elasticsearch",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "asylum-honeypot-dev-0"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "asylum-dev"
        }

      + ports {
          + external = 2222
          + internal = 2222
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
      + ports {
          + external = 2223
          + internal = 2223
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + volumes {
          + container_path = "/cowrie/cowrie-git/var"
          + volume_name    = "asylum-data-dev-0"
        }
    }

  # module.docker[0].docker_container.honeypot[1] will be created
  + resource "docker_container" "honeypot" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "COWRIE_JSON_LOG_ENABLED=true",
          + "COWRIE_OUTPUT_ELASTICSEARCH_ENABLED=true",
          + "COWRIE_OUTPUT_ELASTICSEARCH_HOST=elasticsearch",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "asylum-honeypot-dev-1"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "asylum-dev"
        }

      + ports {
          + external = 2223
          + internal = 2222
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
      + ports {
          + external = 2224
          + internal = 2223
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + volumes {
          + container_path = "/cowrie/cowrie-git/var"
          + volume_name    = "asylum-data-dev-1"
        }
    }

  # module.docker[0].docker_container.prometheus[0] will be created
  + resource "docker_container" "prometheus" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "asylum-prometheus-dev"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + networks_advanced {
          + aliases = []
          + name    = "asylum-dev"
        }

      + ports {
          + external = 9090
          + internal = 9090
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # module.docker[0].docker_image.honeypot[0] will be created
  + resource "docker_image" "honeypot" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "cowrie/cowrie:latest"
      + repo_digest  = (known after apply)
    }

  # module.docker[0].docker_image.prometheus[0] will be created
  + resource "docker_image" "prometheus" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "prom/prometheus:latest"
      + repo_digest  = (known after apply)
    }

  # module.docker[0].docker_network.asylum_network will be created
  + resource "docker_network" "asylum_network" {
      + driver      = "bridge"
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "asylum-dev"
      + options     = (known after apply)
      + scope       = (known after apply)

      + ipam_config {
          + subnet = "10.0.0.0/16"
        }
    }

  # module.docker[0].docker_volume.asylum_data[0] will be created
  + resource "docker_volume" "asylum_data" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "asylum-data-dev-0"
    }

  # module.docker[0].docker_volume.asylum_data[1] will be created
  + resource "docker_volume" "asylum_data" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "asylum-data-dev-1"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_info      = {
      + environment = "dev"
      + node_count  = 2
      + provider    = "docker"
      + region      = "us-east-1"
    }
  + monitoring_endpoints = {
      + grafana    = "http://localhost:3000"
      + kibana     = "http://localhost:5601"
      + prometheus = "http://localhost:9090"
    }
  + network_info         = {
      + cidr        = "10.0.0.0/16"
      + environment = "dev"
    }

Error: building account: could not acquire access token to parse claims: clientCredentialsToken: received HTTP status 400 with response: {"error":"unauthorized_client","error_description":"AADSTS700038: 00000000-0000-0000-0000-000000000000 is not a valid application identifier. Trace ID: b07a5a28-c347-4dda-a274-ec4f9b940d00 Correlation ID: c8a9c492-356d-47f9-8739-0e8a2aeda4c9 Timestamp: 2025-11-18 01:13:01Z","error_codes":[700038],"timestamp":"2025-11-18 01:13:01Z","trace_id":"b07a5a28-c347-4dda-a274-ec4f9b940d00","correlation_id":"c8a9c492-356d-47f9-8739-0e8a2aeda4c9"}

  with provider["registry.terraform.io/hashicorp/azurerm"],
  on providers.tf line 51, in provider "azurerm":
  51: provider "azurerm" {

::error::Terraform exited with code 1.

```

</details>

*Pusher: @Copilot, Action: `pull_request`*